Revit 2024 API
PipeSegment.ScheduleTypeId Property
 The ElementId of the PipeScheduleType.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId ScheduleTypeId { get; }
Visual Basic
Public ReadOnly Property ScheduleTypeId As ElementId
	Get
Visual C++
public:
property ElementId^ ScheduleTypeId {
	ElementId^ get ();
}
See Also
PipeSegment Class
Autodesk.Revit.DB.Plumbing Namespace